In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'A': [1,2,np.nan,4,5],
    'B': [6,np.nan, 8, np.nan, 10],
    'C': [11,12,13,14,np.nan]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

     A     B     C
0  1.0   6.0  11.0
1  2.0   NaN  12.0
2  NaN   8.0  13.0
3  4.0   NaN  14.0
4  5.0  10.0   NaN

In [5]:
# Removing rows with missing values
df_dropna = df.dropna()

In [6]:
print(df_dropna)

     A    B     C
0  1.0  6.0  11.0

In [16]:
# Impputing missing values with the mean
df_fillna_mean = df.fillna(df.mean())
print("\nDataFrame after mean Imputation for missing values : \n")
print(df_fillna_mean)

DataFrame after mean Imputation for missing values :

     A     B     C
0  1.0   6.0  11.0
1  2.0   8.0  12.0
2  3.0   8.0  13.0
3  4.0   8.0  14.0
4  5.0  10.0  12.5

In [22]:
df_fillna_mean

     A     B     C
0  1.0   6.0  11.0
1  2.0   8.0  12.0
2  3.0   8.0  13.0
3  4.0   8.0  14.0
4  5.0  10.0  12.5

## 2

In [23]:
data1 = {
    'ID': [1,2,3,4],
    'Name':['Alice','Bob','Charlie','David'],
    'Age': [25,30,22,27]
}

In [24]:
data2 = {
    'ID': [3,4,5,6],
    'Name':['Charlie','David','Eve','Frank'],
    'Age': [22,27,35,40]
}

In [25]:
dataset1 = pd.DataFrame(data1)
dataset2 = pd.DataFrame(data2)

In [43]:
integrated_dataset = pd.concat([dataset1,dataset2], ignore_index=True)

In [44]:
integrated_dataset

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   22
3   4    David   27
4   3  Charlie   22
5   4    David   27
6   5      Eve   35
7   6    Frank   40

In [46]:
duplicates_removed = integrated_dataset.drop_duplicates(subset='ID',keep='first')
duplicates_removed

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   22
3   4    David   27
6   5      Eve   35
7   6    Frank   40

In [47]:
duplicates_removed.reset_index(inplace=True)

In [48]:
duplicates_removed

   index  ID     Name  Age
0      0   1    Alice   25
1      1   2      Bob   30
2      2   3  Charlie   22
3      3   4    David   27
4      6   5      Eve   35
5      7   6    Frank   40